app/Controllers/User.php

    public function login() {
        $session = \Config\Services::session();
        $userModel = model(UserModel::class);

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $userModel->login_user($username, $password);
        if($user) {
            $data = [
                'userId' => $user->id,
                'first_name' =>$user->first_name,
                'last_name' =>$user->last_name,
                'username' => $user->username,
                'is_superuser' => $user->is_superuser,
                'branch_id' => $user->branch_id,
                'store_id' => $user->store_id,

            ];
            $session->set($data);
            $userModel->update($user->id, ['is_active' => 1]);
---
UPDATE `user` SET `is_active` = 1, `updated_at` = '2023-09-19 20:11:54'
WHERE `user`.`id` IN ('2')

    public function logout() {
        model(UserModel::class)->update(session()->get('userId'), ['is_active' => 0]);
---
UPDATE `user` SET `is_active` = 0, `updated_at` = '2023-09-19 20:12:02'
WHERE `user`.`id` IN ('2')