app/Models/BranchModel.php

SELECT *
FROM `branch`
---
   public function get_branches() {
    return $this->findAll();