app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `username` = 'maria'
AND `password` = '1234'
 LIMIT 1
---
    public function login_user($username, $pass) {
        return $this->where('username', $username)->where('password', $pass)->first();